student = {
    "ID": 1,
    "прізвище": "Іванов",
    "Ім’я": "Іван",
    "Група": "Група А",
    "Курс": 2,
    "Книги (борг)": ["Книга 1", "Книга 2", "Книга 3"],
    "Статистика книг": ["Книга1", "Книга2", "Книга3", "Книга4"]  
}

while True:
    user_input = input("Введіть команду (1 - вивести карту читача, 0 - вийти): ")
    if user_input == "0":
        print("Ви вийшли з програми.")
        break
    elif user_input == "1":
        print(student)
    elif user_input == "2"   
        print("Візьміть книгу")